In [1]:
import numpy as np
import pandas as pd

In [2]:
grades = {"Abdllah":100, "David":75,"Alexa":80}

In [3]:
pd.Series(grades)

Abdllah    100
David       75
Alexa       80
dtype: int64

In [4]:
# arithmetic

In [6]:
contestResult = pd.Series(data = [10,25,100],index = ["Abdllah","David","Alexa"])

In [7]:
contestResult2 = pd.Series(data = [50,35,20],index = ["Abdllah","David","Alexa"])

In [8]:
finalResult  = contestResult + contestResult2

In [9]:
finalResult

Abdllah     60
David       60
Alexa      120
dtype: int64

In [14]:
 difSeries = pd.Series([10,5,7,1,8,23],["a","b","c","d","e","f"])

In [15]:
difSeries2 = pd.Series([20,50,40,1],["a","f","t","v"])

In [16]:
difSeries + difSeries2

a    30.0
b     NaN
c     NaN
d     NaN
e     NaN
f    73.0
t     NaN
v     NaN
dtype: float64

In [17]:
# Data Frame

In [45]:
data = np.random.randn(4,3)

In [46]:
data

array([[-0.40688503, -0.46145878,  0.39459586],
       [ 1.38344855,  1.14723907, -0.34870752],
       [ 0.07010434,  1.27068576, -0.60452156],
       [ 0.35825078, -0.65507415, -0.2111229 ]])

In [47]:
dataFrame = pd.DataFrame(data)

In [48]:
dataFrame

          0         1         2
0 -0.406885 -0.461459  0.394596
1  1.383449  1.147239 -0.348708
2  0.070104  1.270686 -0.604522
3  0.358251 -0.655074 -0.211123

In [49]:
dataFrame[0]

0   -0.406885
1    1.383449
2    0.070104
3    0.358251
Name: 0, dtype: float64

In [50]:
type(dataFrame[0])

pandas.core.series.Series

In [51]:
newDf = pd.DataFrame(data, index = ["Abdllah","Çato","Baris","Emircan"],columns=["Salary","Age","Seniority"])

In [52]:
newDf

           Salary       Age  Seniority
Abdllah -0.406885 -0.461459   0.394596
Çato     1.383449  1.147239  -0.348708
Baris    0.070104  1.270686  -0.604522
Emircan  0.358251 -0.655074  -0.211123

In [53]:
newDf["Age"]

Abdllah   -0.461459
Çato       1.147239
Baris      1.270686
Emircan   -0.655074
Name: Age, dtype: float64

In [54]:
newDf["Salary"]

Abdllah   -0.406885
Çato       1.383449
Baris      0.070104
Emircan    0.358251
Name: Salary, dtype: float64

In [56]:
newDf[["Age","Salary"]]

              Age    Salary
Abdllah -0.461459 -0.406885
Çato     1.147239  1.383449
Baris    1.270686  0.070104
Emircan -0.655074  0.358251

In [57]:
# if we want to return row

In [60]:
newDf.loc["Abdllah"] # "iloc[0]"

Salary      -0.406885
Age         -0.461459
Seniority    0.394596
Name: Abdllah, dtype: float64

In [61]:
newDf["Extra"] = 10

In [62]:
newDf

           Salary       Age  Seniority  Extra
Abdllah -0.406885 -0.461459   0.394596     10
Çato     1.383449  1.147239  -0.348708     10
Baris    0.070104  1.270686  -0.604522     10
Emircan  0.358251 -0.655074  -0.211123     10

In [66]:
# newDf.drop("Extra",axis=1,inplace=True) # default -> axis = 0 , inplace = False

In [67]:
newDf

           Salary       Age  Seniority
Abdllah -0.406885 -0.461459   0.394596
Çato     1.383449  1.147239  -0.348708
Baris    0.070104  1.270686  -0.604522
Emircan  0.358251 -0.655074  -0.211123

In [69]:
newDf[newDf["Salary"] > 0]

           Salary       Age  Seniority
Çato     1.383449  1.147239  -0.348708
Baris    0.070104  1.270686  -0.604522
Emircan  0.358251 -0.655074  -0.211123